lib/stripe_model_callbacks/fixtures/stripe_events/charge/charge.refunded.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "charge.refunded",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2020-03-02",
  "data": {
    "object": {
      "id": "ch_00000000000000",
      "object": "charge",
      "amount": 20000,
      "amount_refunded": 20000,
      "application": null,
      "application_fee": null,
      "application_fee_amount": null,
      "balance_transaction": "txn_00000000000000",
      "billing_details": {
        "address": {
          "city": null,
          "country": null,
          "line1": null,
          "line2": null,
          "postal_code": null,
          "state": null
        },
        "email": null,
        "name": null,
        "phone": null
      },
      "captured": true,
      "created": 1518182597,
      "currency": "usd",
      "customer": "cus_00000000000000",
      "description": null,
      "disputed": false,
      "failure_code": null,
      "failure_message": null,
      "fraud_details": {
      },
      "invoice": "in_00000000000000",
      "livemode": false,
      "metadata": {
      },
      "on_behalf_of": null,
      "order": null,
      "outcome": {
        "network_status": "approved_by_network",
        "reason": null,
        "risk_level": "normal",
        "seller_message": "Payment complete.",
        "type": "authorized"
      },
      "paid": true,
      "payment_intent": null,
      "payment_method": "card_00000000000000",
      "payment_method_details": {
        "card": {
          "brand": "visa",
          "checks": {
            "address_line1_check": null,
            "address_postal_code_check": null,
            "cvc_check": "pass"
          },
          "country": "US",
          "exp_month": 1,
          "exp_year": 2040,
          "fingerprint": "PbZwGd4GZfLoNM7C",
          "funding": "credit",
          "installments": null,
          "last4": "4242",
          "network": "visa",
          "three_d_secure": null,
          "wallet": null
        },
        "type": "card"
      },
      "receipt_email": "kaspernj@gmail.com",
      "receipt_number": null,
      "receipt_url": "https://pay.stripe.com/receipts/acct_1Bsw4fEKaFxLwikq/ch_1BtbqTEKaFxLwikq6HVc48KS/rcpt_EHYy0EDjiG3aYidyAunA1mPBiRnLL2t",
      "refunded": true,
      "refunds": {
        "object": "list",
        "data": [
          {
            "id": "re_00000000000000",
            "object": "refund",
            "amount": 20000,
            "balance_transaction": "txn_00000000000000",
            "charge": "ch_00000000000000",
            "created": 1584470640,
            "currency": "usd",
            "metadata": {
            },
            "payment_intent": null,
            "reason": null,
            "receipt_number": "1554-2183",
            "source_transfer_reversal": null,
            "status": "succeeded",
            "transfer_reversal": null
          }
        ],
        "has_more": false,
        "url": "/v1/charges/ch_1BtbqTEKaFxLwikq6HVc48KS/refunds"
      },
      "review": null,
      "shipping": null,
      "source_transfer": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null,
      "fee": 0
    }
  }
}